""" 7.	Даны числа a1, b1, c1, a2, b2, c2. Напечатать координаты точки пересечения прямых,
описываемых уравнениями a1x+b1y=c1 и a2x+b2y=c2, либо сообщить, что эти прямые совпадают или параллельны.
На плоскости заданы три точки M1(x1, y1), M2(x2, y2) и М3(x3, y3).
Определить, к какой из точек М1 или М3 точка М2 расположена ближе. """

a1 = int(input('Введите a1 = '))
b1 = int(input('Введите b1 = '))
c1 = int(input('Введите c1 = '))
a2 = int(input('Введите a2 = '))
b2 = int(input('Введите b2 = '))
c2 = int(input('Введите c2 = '))

