""" 2.	Дана последовательность символов S1, ..., Sn.
Выяснить, встречается ли в данной последовательности символов группа из трех стоящих рядом точек. """

simbols = str(input('Введите символы:  '))

print(simbols)