""" 3.	Дана последовательность символов S1, ..., Sn.
Известно, что среди них есть по крайней мере одна запятая.
Найти натуральное i такое, что Si - первая по порядку запятая. """

sequence = str('word, word1, word')
asd = sequence.find(',')
print(asd)